<a href="https://colab.research.google.com/github/madhav7034/Notes/blob/main/Database.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
"""
Databases
improves business processes
Keep track of customers
Store personal data



Types of database

1. Relational database
2. Object oriented
3. Distributed
4. Data warehouses
5. NoSql database


---> Relational database
        Rows and columns
Sql --> Access and manipulate data



Importance of Sql

Foundation of data management
Data extraction
Data manipulation
Integration with data tools
Handling large dataset
Data Aggregation and Summarization
Real time data processing

Columns are called attributes or fields
Rows records or tupils


KEYS

1. Primary Key
2. Foreign Key
3. Composite Key
4. Unique Key


DDL---> Data Definiton Language

1. Create
2. Alter
3. Drop

"""

import sqlite3
conn = sqlite3.connect('students.db')
cursor = conn.cursor()

In [ ]:
from typing import Text
cursor.execute("""CREATE TABLE IF NOT EXISTS students(
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    age INTEGER,
    gender TEXT,
    grade Text
    )
   """)

In [ ]:
cursor.execute("insert into students values(23,'A','20','Male','A')")

In [ ]:
cursor.execute("insert into students values(24,'B','20','Female','A+')")

In [ ]:
cursor.execute("insert into students values(25,'C','19','Male','C')")

In [ ]:
cursor.execute("insert into students values(26,'D','20','Female','B')")

In [ ]:
cursor.execute("insert into students values(27,'E','18','Male','A+')")

In [ ]:
cursor.execute("insert into students values('F','20','Male','A')")

OperationalError: table students has 5 columns but 4 values were supplied

In [ ]:
conn.commit()

In [ ]:
cursor.execute('select * from students')

In [ ]:
#print(cursor.fetchall())

In [ ]:
rows = cursor.fetchall()

In [ ]:
for row in rows:
  print('id:',row[0],'name:',row[1],'age:',row[2],'gender:',row[3],'grade',row[4])

id: 23 name: A age: 20 gender: Male grade A
id: 24 name: B age: 20 gender: Female grade A+
id: 25 name: C age: 19 gender: Male grade C
id: 26 name: D age: 20 gender: Female grade B
id: 27 name: E age: 18 gender: Male grade A+

In [ ]:
cursor.execute('select * from students where grade = "A+"')
rows = cursor.fetchall()
for row in rows:
  print('id:',row[0],'name:',row[1],'age:',row[2],'gender:',row[3],'grade',row[4])

id: 24 name: B age: 20 gender: Female grade A+
id: 27 name: E age: 18 gender: Male grade A+

In [ ]:
cursor.execute('select * from students order by age desc')
rows = cursor.fetchall()
for row in rows:
  print('id:',row[0],'name:',row[1],'age:',row[2],'gender:',row[3],'grade',row[4])

id: 23 name: A age: 20 gender: Male grade A
id: 24 name: B age: 20 gender: Female grade A+
id: 26 name: D age: 20 gender: Female grade B
id: 25 name: C age: 19 gender: Male grade C
id: 27 name: E age: 18 gender: Male grade A+

In [ ]:
cursor.execute("select count(*) from students where grade = 'A+'")
rows = cursor.fetchall()
for row in rows:
  print('grade',row[0])

grade 2

In [ ]:
cursor.execute("select avg(age) from students")
rows = cursor.fetchall()
for row in rows:
  print('age:',row[0])

age: 19.4

In [ ]:
cursor.execute("select * from students order by age desc limit 3")
rows = cursor.fetchall()
for row in rows:
  print('id:',row[0],'name:',row[1],'age:',row[2],'gender:',row[3],'grade',row[4])

id: 23 name: A age: 20 gender: Male grade A
id: 24 name: B age: 20 gender: Female grade A+
id: 26 name: D age: 20 gender: Female grade B

In [ ]:
cursor.execute("select age, count(*) from students group by age")
rows = cursor.fetchall()
for row in rows:
  print('age:',row[0])

age: 18
age: 19
age: 20

In [ ]:
cursor.execute("alter table students add column mark integer")

In [ ]:
cursor.execute("update students set mark = 100 where id = 24")
cursor.execute("update students set mark = 100 where id = 27")
cursor.execute("update students set mark = 92 where id = 23")
cursor.execute("update students set mark = 80 where id = 26")
cursor.execute("update students set mark = 67 where id = 25")

In [ ]:
cursor.execute('select * from students')
rows = cursor.fetchall()
for row in rows:
  print('id:',row[0],'name:',row[1],'age:',row[2],'gender:',row[3],'grade',row[4],'mark',row[5])

id: 23 name: A age: 20 gender: Male grade A mark 92
id: 24 name: B age: 20 gender: Female grade A+ mark 100
id: 25 name: C age: 19 gender: Male grade C mark 67
id: 26 name: D age: 20 gender: Female grade B mark 80
id: 27 name: E age: 18 gender: Male grade A+ mark 100

In [ ]:
cursor.execute("delete from students where id = 23")

In [ ]:
cursor.execute('select * from students')
rows = cursor.fetchall()
for row in rows:
  print('id:',row[0],'name:',row[1],'age:',row[2],'gender:',row[3],'grade',row[4],'mark',row[5])

id: 24 name: B age: 20 gender: Female grade A+ mark 100
id: 25 name: C age: 19 gender: Male grade C mark 67
id: 26 name: D age: 20 gender: Female grade B mark 80
id: 27 name: E age: 18 gender: Male grade A+ mark 100

In [ ]:
#Library



import sqlite3
conn = sqlite3.connect('lib.db')
cursor = conn.cursor()

In [ ]:
from typing import Text
cursor.execute("""CREATE TABLE IF NOT EXISTS lib(
    bookid INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    author TEXT,
    pdate DATE
    )
   """)

In [ ]:
cursor.execute("insert into lib values(100,'Book A','Riyan','2021-08-21'),(101,'Book B','Farhan','2020-09-12'),(102,'Book C','Govind','2019-01-18')")

In [ ]:
cursor.execute('select * from lib')
rows = cursor.fetchall()
for row in rows:
  print('bookid:',row[0],'name:',row[1],'author:',row[2],'pdate',row[3])

bookid: 100 name: Book A author: Riyan pdate 2021-08-21
bookid: 101 name: Book B author: Farhan pdate 2020-09-12
bookid: 102 name: Book C author: Govind pdate 2019-01-18